AdrianBesciak/InternetRadioReceiver/InternetRadioReceiver.ioc
#MicroXplorer Configuration settings - do not modify
PB13.GPIOParameters=GPIO_Label
PD12.GPIO_Label=QSPI_D1 [N25Q128A13EF840E_DQ1]
PC7.GPIOParameters=GPIO_Label
SH.FMC_D0_DA0.ConfNb=1
PI7.GPIOParameters=GPIO_Label
SH.FMC_A8.ConfNb=1
SH.FMC_A0.ConfNb=1
SH.FMC_D6_DA6.ConfNb=1
SH.FMC_D9_DA9.ConfNb=1
FATFS._USE_LFN=0
SH.FMC_A0.0=FMC_A0
PE11.GPIOParameters=GPIO_Label
FATFS0.BSP.api=Unknown
PH15.GPIO_Label=TP3
PG8.Signal=FMC_SDCLK
PG8.Locked=true
PG0.Locked=true
RCC.PLLQCLKFreq_Value=48000000
PC7.Locked=true
PG0.Signal=FMC_A10
PD8.Locked=true
PI15.GPIO_Label=LCD_R0 [RK043FN48H-CT672B_R0]
PD0.Locked=true
PD2.GPIOParameters=GPIO_Label
SH.FMC_SDNWE.ConfNb=1
PK1.Signal=LTDC_G6
PG14.GPIOParameters=GPIO_Label
SH.S_TIM1_CH1.ConfNb=1
USART1.IPParameters=VirtualMode-Asynchronous
SH.FMC_D5_DA5.0=FMC_D5
PA2.GPIOParameters=GPIO_Label
PJ2.GPIOParameters=GPIO_Label
PG2.GPIOParameters=GPIO_Label
SH.FMC_D9_DA9.0=FMC_D9
RCC.LPTIM1Freq_Value=54000000
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:true\:false
PG15.GPIO_Label=FMC_SDNCAS [MT48LC4M32B2B5-6A_CAS]
SH.FMC_SDNWE.0=FMC_SDNWE
PH9.Signal=DCMI_D0
SH.FMC_D11_DA11.0=FMC_D11
RCC.I2C4Freq_Value=54000000
RCC.APB2TimFreq_Value=216000000
PB6.Signal=QUADSPI_BK1_NCS
PC7.Signal=USART6_RX
PD0.Signal=FMC_D2_DA2
PD8.Signal=FMC_D13_DA13
PE1.Signal=FMC_NBL1
FATFS0.BSP.ip=GPIO
PE14.Locked=true
RCC.USART3Freq_Value=54000000
RCC.PLLSAIRCLKFreq_Value=50000000
ProjectManager.ProjectBuild=false
PJ14.Locked=true
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:false
PJ12.GPIOParameters=GPIO_Label
PB3.Mode=Trace_Asynchronous_SW
PA8.Locked=true
PF1.GPIO_Label=FMC_A1 [MT48LC4M32B2B5-6A_A1]
PI4.GPIO_Label=SAI2_MCLKA [WM8994ECS/R_MCLK1]
PK4.GPIO_Label=LCD_B5 [RK043FN48H-CT672B_B5]
PJ10.GPIOParameters=GPIO_Label
PD1.GPIO_Label=FMC_D3 [MT48LC4M32B2B5-6A_DQ3]
PB12.GPIO_Label=ULPI_D5 [USB3320C-EZK_D5]
PG14.Mode=RMII
ProjectManager.FirmwarePackage=STM32Cube FW_F7 V1.16.1
PF12.GPIO_Label=FMC_A6 [MT48LC4M32B2B5-6A_A6]
PI7.Locked=true
ProjectManager.BackupPrevious=false
SAI2.Instance-SAI_B_SyncSlave=SAI$Index_Block_B
SH.S_TIM12_CH1.0=TIM12_CH1
PG12.GPIOParameters=GPIO_Label
PE9.Signal=FMC_D6_DA6
PI2.Locked=true
SH.FMC_A2.0=FMC_A2
PE9.Locked=true
PB1.GPIO_Label=ULPI_D2 [USB3320C-EZK_D2]
PG4.GPIO_Label=FMC_BA0 [MT48LC4M32B2B5-6A_BA0]
PC9.Mode=SD_4_bits_Wide_bus
PF13.Locked=true
PI15.GPIOParameters=GPIO_Label
PA8.Signal=S_TIM1_CH1
PE1.Locked=true
SH.FMC_D1_DA1.0=FMC_D1
PB6.Locked=true
PC15/OSC32_OUT.Locked=true
ProjectManager.HalAssertFull=false
PJ14.Signal=LTDC_B2
PB9.Signal=I2C1_SDA
Mcu.Package=TFBGA216
SAI2.RealAudioFreq-SAI_A_MasterWithClock=187.5 KHz
PB1.Signal=USB_OTG_HS_ULPI_D2
PB14.GPIO_PuPd=GPIO_NOPULL
PA5.Locked=true
PJ11.Locked=true
PD12.Signal=QUADSPI_BK1_IO1
SH.FMC_SDNCAS.ConfNb=1
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
SH.FMC_A11.ConfNb=1
PJ8.Locked=true
PB9.GPIO_PuPd=GPIO_NOPULL
PA10.Signal=USB_OTG_FS_ID
PJ3.Locked=true
FREERTOS.FootprintOK=true
PE12.GPIO_Label=FMC_D9 [MT48LC4M32B2B5-6A_DQ9]
PH6.Locked=true
PC11.Mode=SD_4_bits_Wide_bus
PH9.Locked=true
RCC.APB2CLKDivider=RCC_HCLK_DIV2
PI7.Mode=SAI_A_MasterWithClock
RCC.APB1TimFreq_Value=108000000
PC14/OSC32_IN.GPIO_Label=RCC_OSC32_IN
Dma.SDMMC1_RX.0.Mode=DMA_PFCTRL
PD5.Locked=true
PJ0.Locked=true
PK1.Locked=true
PA8.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PD15.Signal=FMC_D1_DA1
NVIC.RCC_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:false
PJ1.GPIO_Label=LCD_R2 [RK043FN48H-CT672B_R2]
RCC.PLLSAIQCLKFreq_Value=50000000
SH.FMC_D3_DA3.ConfNb=1
PG12.Signal=LTDC_B4
PD6.GPIOParameters=GPIO_Label,GPIO_ModeDefaultEXTI
Mcu.Pin80=PJ10
Mcu.Pin81=PG8
FATFS0.BSP.STBoard=false
SH.FMC_A4.0=FMC_A4
PK4.Signal=LTDC_B5
ProjectManager.ProjectFileName=InternetRadioReceiver.ioc
SH.FMC_A5.ConfNb=1
FREERTOS.Tasks01=defaultTask,24,1024,StartDefaultTask,Default,NULL,Dynamic,NULL,NULL
PH13.Locked=true
Dma.SDMMC1_RX.0.PeriphInc=DMA_PINC_DISABLE
PH13.Signal=GPIO_Output
Mcu.Pin79=PJ8
PI10.Locked=true
Mcu.PinsNb=160
PC11.Locked=true
Mcu.Pin73=PC8
Mcu.Pin74=PC7
Mcu.Pin71=PJ11
Mcu.Pin72=PK0
PC13.Locked=true
PI13.GPIO_ModeDefaultEXTI=GPIO_MODE_EVT_RISING
Mcu.Pin77=PI14
PG5.Locked=true
Mcu.Pin78=PH4
PG5.Signal=FMC_A15_BA1
Mcu.Pin75=PH1/OSC_OUT
PC13.Signal=GPIO_Input
Mcu.Pin76=PF3
PG3.Locked=true
SH.FMC_D10_DA10.0=FMC_D10
FATFS0.BSP.mode=Input
PD3.Signal=DCMI_D5
Mcu.Pin70=PI15
PC2.Signal=USB_OTG_HS_ULPI_DIR
PI12.Signal=GPIO_Output
Mcu.Pin68=PF2
Mcu.Pin69=PI13
PB14.Locked=true
Mcu.Pin62=PC15/OSC32_OUT
PG14.Locked=true
Mcu.Pin63=PK1
Mcu.Pin60=PI0
Mcu.Pin61=PA9
Mcu.Pin66=PA8
Mcu.Pin67=PH0/OSC_IN
Mcu.Pin64=PK2
Mcu.Pin65=PC9
PJ11.Signal=LTDC_G4
ETH.IPParameters=MediaInterface
PC3.GPIOParameters=GPIO_Label
PD10.Signal=FMC_D15_DA15
PB8.GPIO_Label=ARDUINO SCL/D15
PJ8.GPIO_Label=LCD_G1 [RK043FN48H-CT672B_G1]
PA15.Locked=true
PJ3.Signal=LTDC_R4
PI8.GPIO_Label=NC1 [TP2]
PA8.GPIO_Label=ARDUINO PWM/D10
Mcu.Pin59=PH14
Mcu.Pin57=PI9
Mcu.Pin58=PH13
PH11.GPIOParameters=GPIO_Label
Mcu.Pin51=PH15
RCC.USART6Freq_Value=108000000
Mcu.Pin52=PI1
Mcu.Pin50=PD2
CORTEX_M7.ART_ACCLERATOR_ENABLE=1
Mcu.Pin55=PF1
Mcu.Pin56=PI12
Mcu.Pin53=PA10
PJ14.GPIOParameters=GPIO_Label
Mcu.Pin54=PC14/OSC32_IN
PE8.GPIO_Label=FMC_D5 [MT48LC4M32B2B5-6A_DQ5]
PH11.GPIO_Label=DCMI_D2
PI6.Mode=SAI_A_MasterWithClock
PB9.Locked=true
PB11.GPIOParameters=GPIO_Label
PI12.Locked=true
NVIC.DMA2_Stream6_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
PJ11.GPIO_Label=LCD_G4 [RK043FN48H-CT672B_G4]
PI3.GPIOParameters=GPIO_Label
Mcu.Pin48=PJ15
Mcu.Pin49=PD4
Mcu.Pin46=PK3
PH13.GPIOParameters=GPIO_Label
Mcu.Pin47=PG9
PF3.GPIOParameters=GPIO_Label
PC14/OSC32_IN.GPIOParameters=GPIO_Label
PG6.GPIOParameters=GPIO_Label
PJ6.GPIOParameters=GPIO_Label
PB14.Signal=SPI2_MISO
Mcu.Pin40=PF0
PA5.Signal=I2S1_CK
Mcu.Pin41=PI5
PE13.GPIOParameters=GPIO_Label
PC12.Mode=SD_4_bits_Wide_bus
Mcu.Pin44=PI6
Mcu.Pin45=PK4
Mcu.Pin42=PI7
Mcu.Pin43=PI10
PJ4.GPIO_Label=LCD_R5 [RK043FN48H-CT672B_R5]
PE1.GPIO_Label=FMC_NBL1 [MT48LC4M32B2B5-6A_DQM1]
PK7.GPIO_Label=LCD_DE [RK043FN48H-CT672B_DE]
PI7.Signal=SAI2_FS_A
SH.FMC_A6.0=FMC_A6
PE14.Signal=FMC_D11_DA11
PB4.GPIO_Label=ARDUINO PWM/D3
Mcu.Pin37=PI2
Mcu.Pin38=PA11
Mcu.Pin35=PD1
PB15.GPIO_Label=ARDUINO MOSI/PWM/D11
RCC.I2C1Freq_Value=54000000
Mcu.Pin36=PI3
RCC.PLLI2SPCLKFreq_Value=96000000
SH.ADCx_IN0.ConfNb=1
SH.FMC_D14_DA14.ConfNb=1
Mcu.Pin39=PC13
PG7.GPIO_Label=ARDUINO D4
PI2.Signal=GPIO_Output
PF4.GPIO_Label=FMC_A4 [MT48LC4M32B2B5-6A_A4]
Mcu.Pin30=PG12
Mcu.Pin33=PD5
Mcu.Pin34=PD3
Mcu.Pin31=PG10
Mcu.Pin32=PJ14
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:false
PF13.Signal=FMC_A7
PC10.GPIOParameters=GPIO_Label
PA0/WKUP.GPIO_PuPd=GPIO_NOPULL
PJ15.GPIO_Label=LCD_B3 [RK043FN48H-CT672B_B3]
RCC.PLLI2SQCLKFreq_Value=96000000
PI9.GPIOParameters=GPIO_Label
Mcu.Pin26=PI4
Mcu.Pin27=PK7
Mcu.Pin24=PA12
Mcu.Pin25=PI8
CORTEX_M7.IPParameters=ART_ACCLERATOR_ENABLE,PREFETCH_ENABLE,CPU_ICache,CPU_DCache
Mcu.Pin28=PK6
PC7.GPIO_Label=ARDUINO RX/D0
Mcu.Pin29=PK5
PC8.Mode=SD_4_bits_Wide_bus
PB4.Locked=true
PD14.GPIOParameters=GPIO_Label
Mcu.Pin22=PC11
ETH.MediaInterface=ETH_MEDIA_INTERFACE_RMII
Mcu.Pin23=PC10
Mcu.Pin20=PD6
SAI2.Instance-SAI_A_MasterWithClock=SAI$Index_Block_A
Mcu.Pin21=PD0
PA3.Locked=true
PD10.Locked=true
PJ0.GPIOParameters=GPIO_Label
PA10.Locked=true
NVIC.ForceEnableDMAVector=true
PA14.GPIOParameters=GPIO_Label
PC14/OSC32_IN.Locked=true
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:false
PC12.GPIO_Label=SDMMC_CK
Dma.SDMMC1_TX.1.PeriphDataAlignment=DMA_PDATAALIGN_WORD
PD15.Locked=true
PJ8.Signal=LTDC_G1
PJ0.GPIO_Label=LCD_R1 [RK043FN48H-CT672B_R1]
SH.FMC_SDNRAS.ConfNb=1
ProjectManager.HeapSize=0x200
Mcu.Pin15=PB6
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:false
Mcu.Pin16=PG15
Mcu.Pin13=PB9
Mcu.Pin14=PB7
PH6.Signal=S_TIM12_CH1
Mcu.Pin19=PJ12
Mcu.Pin17=PG11
Mcu.Pin18=PJ13
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PA13
Mcu.Pin12=PG13
PD0.GPIOParameters=GPIO_Label
PF0.GPIO_Label=FMC_A0 [MT48LC4M32B2B5-6A_A0]
PI1.GPIO_Mode=GPIO_MODE_AF_PP
PG0.GPIOParameters=GPIO_Label
Mcu.Pin10=PA14
PE3.Signal=GPIO_Input
PC15/OSC32_OUT.Signal=RCC_OSC32_OUT
PF4.Signal=FMC_A4
PD2.Signal=SDMMC1_CMD
FATFS0.BSP.name=Detect_SDIO
PC1.Mode=RMII
PG15.Locked=true
PI1.GPIO_Label=ARDUINO SCK/D13
Mcu.Family=STM32F7
ProjectManager.MainLocation=Core/Src
SH.FMC_A6.ConfNb=1
PK3.Signal=GPIO_Output
SH.FMC_A8.0=FMC_A8
PC15/OSC32_OUT.GPIO_Label=RCC_OSC32_OUT
PG9.GPIOParameters=GPIO_Label
Mcu.Pin150=PE10
Mcu.Pin151=PE12
ProjectManager.KeepUserCode=true
PH14.Signal=DCMI_D4
FATFS0.BSP.semaphore=
PH10.Signal=DCMI_D1
SH.FMC_D14_DA14.0=FMC_D14
Mcu.Pin156=PB15
Mcu.Pin157=VP_FATFS_VS_SDIO
PG2.Signal=GPIO_Input
Mcu.Pin158=VP_FREERTOS_VS_CMSIS_V2
Mcu.Pin159=VP_SYS_VS_Systick
PE11.GPIO_Label=FMC_D8 [MT48LC4M32B2B5-6A_DQ8]
Mcu.Pin152=PE15
Mcu.Pin153=PE13
Mcu.Pin154=PB11
PG2.Locked=true
Mcu.Pin155=PB14
PC5.Locked=true
PF0.GPIOParameters=GPIO_Label
PA12.GPIOParameters=GPIO_Label
PA11.GPIOParameters=GPIO_Label
PD0.GPIO_Label=FMC_D2 [MT48LC4M32B2B5-6A_DQ2]
PH10.Locked=true
PD6.Locked=true
PD2.Locked=true
SH.FMC_A14_BA0.0=FMC_BA0
SH.FMC_A11.0=FMC_A11
Dma.SDMMC1_RX.0.Instance=DMA2_Stream3
Dma.SDMMC1_RX.0.FIFOMode=DMA_FIFOMODE_ENABLE
PB13.GPIO_Label=ULPI_D6 [USB3320C-EZK_D6]
PG5.GPIO_Label=FMC_BA1 [MT48LC4M32B2B5-6A_BA1]
PI5.Mode=SAI_A_MasterWithClock
PB15.Signal=SPI2_MOSI
PF12.GPIOParameters=GPIO_Label
PG15.Signal=FMC_SDNCAS
PG11.Signal=ETH_TX_EN
PH5.GPIOParameters=GPIO_Label
PJ5.GPIO_Label=LCD_R6 [RK043FN48H-CT672B_R6]
PJ14.GPIO_Label=LCD_B2 [RK043FN48H-CT672B_B2]
Mcu.Pin138=PE14
Mcu.Pin139=PB10
PD13.Signal=QUADSPI_BK1_IO3
Mcu.IP4=FREERTOS
Mcu.IP5=NVIC
RCC.FCLKCortexFreq_Value=216000000
PD13.Locked=true
Mcu.IP2=ETH
Mcu.IP3=FATFS
PA15.GPIO_Label=ARDUINO PWM/D9
PK4.GPIOParameters=GPIO_Label
Mcu.IP0=CORTEX_M7
Mcu.IP1=DMA
PJ2.Signal=LTDC_R3
PF1.GPIOParameters=GPIO_Label
RCC.SDMMCFreq_Value=48000000
Mcu.Pin134=PJ2
Mcu.Pin135=PF11
Mcu.Pin136=PE9
Mcu.Pin137=PE11
Mcu.Pin130=PA6
Mcu.Pin131=PA5
Mcu.Pin132=PC5
Mcu.Pin133=PF14
ProjectManager.PreviousToolchain=STM32CubeIDE
PF1.Locked=true
PG8.GPIOParameters=GPIO_Label
Mcu.Pin149=PE7
SH.FMC_NBL1.0=FMC_NBL1
PA8.GPIOParameters=GPIO_ModeDefaultPP,GPIO_Speed,GPIO_PuPd,GPIO_Label
FREERTOS.IPParameters=Tasks01,FootprintOK
PA15.GPIO_ModeDefaultPP=GPIO_MODE_AF_PP
Mcu.Pin140=PH6
Mcu.Pin145=PB1
Mcu.Pin146=PB0
RCC.HSE_VALUE=25000000
Mcu.Pin147=PJ0
Mcu.Pin148=PJ1
Mcu.Pin141=PH8
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:false
SH.FMC_A14_BA0.ConfNb=1
Mcu.Pin142=PH10
Mcu.Pin143=PA3
Mcu.Pin144=PA7
Mcu.IP10=USART1
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:true\:true\:true\:true
PC15/OSC32_OUT.GPIOParameters=GPIO_Label
PI4.Locked=true
RCC.VCOInputFreq_Value=1000000
PA14.Mode=Trace_Asynchronous_SW
PH7.GPIO_Label=LCD_SCL [RK043FN48H-CT672B_SCL]
PE8.Locked=true
PJ7.GPIO_Label=LCD_G0 [RK043FN48H-CT672B_G0]
PF11.Signal=FMC_SDNRAS
PC11.GPIO_Label=SDMMC_D3
PE3.GPIOParameters=GPIO_Label
PK3.GPIOParameters=GPIO_Label
PJ12.GPIO_Label=OTG_FS_VBUS
PB7.Signal=USART1_RX
PE3.Locked=true
PH6.GPIOParameters=GPIO_Label
SH.S_TIM3_CH1.0=TIM3_CH1
PF11.GPIOParameters=GPIO_Label
PB6.GPIOParameters=GPIO_Label
PB0.Locked=true
PA13.GPIOParameters=GPIO_Label
PD13.GPIO_Label=QSPI_D3 [N25Q128A13EF840E_DQ3]
PJ13.Locked=true
PA6.Signal=DCMI_PIXCLK
PG11.Locked=true
PB15.GPIO_PuPd=GPIO_NOPULL
PD5.GPIO_Label=OTG_FS_PowerSwitchOn [STMPS2141STR_EN]
SH.FMC_D4_DA4.ConfNb=1
ProjectManager.ToolChainLocation=
PA15.Signal=S_TIM2_CH1_ETR
PG0.GPIO_Label=FMC_A10 [MT48LC4M32B2B5-6A_A10]
PI0.GPIO_Label=ARDUINO PWM/CS/D5
PA0/WKUP.GPIO_Mode=GPIO_MODE_ANALOG
Mcu.Pin95=PD10
Mcu.Pin96=PC3
Mcu.Pin93=PD15
Mcu.Pin94=PB13
Mcu.Pin99=PD9
Mcu.Pin97=PD14
Mcu.Pin98=PB12
Dma.Request1=SDMMC1_TX
Mcu.Pin91=PH2
Mcu.Pin92=PJ6
PG11.GPIO_Label=RMII_TX_EN [LAN8742A-CZ-TR_TXEN]
PD3.GPIO_Label=DCMI_D5
Mcu.Pin90=PF5
PC5.Signal=ETH_RXD1
PE7.Signal=FMC_D4_DA4
PD6.Signal=GPXTI6
Dma.Request0=SDMMC1_RX
PF3.GPIO_Label=FMC_A3 [MT48LC4M32B2B5-6A_A3]
Dma.SDMMC1_RX.0.MemDataAlignment=DMA_MDATAALIGN_WORD
PF15.GPIOParameters=GPIO_Label
PE12.Locked=true
Mcu.Pin84=PH5
Mcu.Pin85=PH3
PB4.Signal=S_TIM3_CH1
Mcu.Pin82=PC6
PB15.Locked=true
Mcu.Pin83=PF4
PG2.GPIO_Label=RMII_RXER
Mcu.Pin88=PG7
PA3.Signal=USB_OTG_HS_ULPI_D0
SAI2.MClockEnable-SAI_A_MasterWithClock=SAI_MASTERCLOCK_ENABLE
Mcu.Pin89=PG6
Mcu.Pin86=PJ7
Mcu.Pin87=PJ9
SH.FMC_A3.ConfNb=1
PK6.Signal=LTDC_B7
PK6.Locked=true
RCC.I2SFreq_Value=96000000
PK4.Locked=true
PH8.GPIOParameters=GPIO_Label
PH15.Locked=true
PB8.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PG7.Locked=true
PD15.GPIO_Label=FMC_D1 [MT48LC4M32B2B5-6A_DQ1]
PG7.Signal=GPIO_Output
RCC.UART7Freq_Value=54000000
PE14.GPIOParameters=GPIO_Label
PH12.GPIO_Label=DCMI_D3
NVIC.SavedSvcallIrqHandlerGenerated=true
FATFS._USE_MUTEX=0
PC11.Signal=SDMMC1_D3
PI14.Signal=LTDC_CLK
PC8.Signal=SDMMC1_D0
PC10.Mode=SD_4_bits_Wide_bus
ProjectManager.DefaultFWLocation=true
PE14.GPIO_Label=FMC_D11 [MT48LC4M32B2B5-6A_DQ11]
PD9.Signal=FMC_D14_DA14
PB12.Locked=true
ProjectManager.DeletePrevious=true
PB10.Locked=true
RCC.LCDTFToutputFreq_Value=25000000
boardIOC=true
PA12.GPIO_Label=OTG_FS_P
PinOutPanel.CurrentBGAView=Top
RCC.FamilyName=M
PD8.GPIO_Label=FMC_D13 [MT48LC4M32B2B5-6A_DQ13]
PB9.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PE15.GPIOParameters=GPIO_Label
FATFS0.BSP.instance=PC13
SH.GPXTI6.0=GPIO_EXTI6
PG8.GPIO_Label=FMC_SDCLK [MT48LC4M32B2B5-6A_CLK]
FATFS.IPParameters=_USE_LFN,_USE_MUTEX
USART1.VirtualMode-Asynchronous=VM_ASYNC
PA13.Signal=SYS_JTMS-SWDIO
PA9.Mode=Asynchronous
PJ5.Locked=true
SH.FMC_A15_BA1.ConfNb=1
PK2.GPIOParameters=GPIO_Label
SH.S_TIM1_CH1.0=TIM1_CH1
PH7.GPIOParameters=GPIO_Label
PH8.Locked=true
PB10.GPIO_Label=ULPI_D3 [USB3320C-EZK_D3]
SH.FMC_D13_DA13.0=FMC_D13
PH8.Signal=I2C3_SDA
PC5.GPIOParameters=GPIO_Label
PK0.GPIOParameters=GPIO_Label
PG10.GPIOParameters=GPIO_Label
PE0.Locked=true
RCC.USBFreq_Value=48000000
PI5.GPIOParameters=GPIO_Label
PD10.GPIO_Label=FMC_D15 [MT48LC4M32B2B5-6A_DQ15]
PA1.Signal=ETH_REF_CLK
RCC.VCOI2SOutputFreq_Value=192000000
PD2.Mode=SD_4_bits_Wide_bus
PH9.GPIOParameters=GPIO_Label
RCC.PLLSAIPCLKFreq_Value=50000000
board=STM32F746G-DISCO
RCC.VCOOutputFreq_Value=432000000
PF14.GPIOParameters=GPIO_Label
PI9.Signal=LTDC_VSYNC
PH4.GPIO_Label=ULPI_NXT [USB3320C-EZK_NXT]
PI9.Locked=true
PI13.GPIO_Label=LCD_INT
RCC.UART4Freq_Value=54000000
MxCube.Version=6.2.0
PJ4.GPIOParameters=GPIO_Label
PI4.Signal=SAI2_MCLK_A
PD4.GPIOParameters=GPIO_Label
PA10.GPIOParameters=GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
SH.FMC_D12_DA12.0=FMC_D12
PF15.GPIO_Label=FMC_A9 [MT48LC4M32B2B5-6A_A9]
Dma.SDMMC1_RX.0.MemBurst=DMA_MBURST_INC4
PF14.Locked=true
PI1.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PF1.Signal=FMC_A1
SH.FMC_D11_DA11.ConfNb=1
RCC.UART5Freq_Value=54000000
RCC.IPParameters=AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CECFreq_Value,CortexFreq_Value,EthernetFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,I2SFreq_Value,LCDTFToutputFreq_Value,LPTIM1Freq_Value,LSE_VALUE,LSI_VALUE,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLI2SPCLKFreq_Value,PLLI2SQCLKFreq_Value,PLLI2SRCLKFreq_Value,PLLI2SRoutputFreq_Value,PLLM,PLLN,PLLQ,PLLQCLKFreq_Value,PLLQoutputFreq_Value,PLLSAIN,PLLSAIPCLKFreq_Value,PLLSAIQCLKFreq_Value,PLLSAIRCLKFreq_Value,PLLSAIoutputFreq_Value,PLLSourceVirtual,RNGFreq_Value,SAI1Freq_Value,SAI2Freq_Value,SDMMCClockSelection,SDMMCFreq_Value,SPDIFRXFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,UART5Freq_Value,UART7Freq_Value,UART8Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USART6Freq_Value,USBFreq_Value,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value
PJ0.Signal=LTDC_R1
ProjectManager.AskForMigrate=true
PE0.Signal=FMC_NBL0
PE7.GPIO_Label=FMC_D4 [MT48LC4M32B2B5-6A_DQ4]
PE12.Signal=FMC_D9_DA9
NVIC.SavedPendsvIrqHandlerGenerated=true
PB2.Locked=true
Mcu.IP8=SDMMC1
Mcu.IP9=SYS
Mcu.IP6=RCC
Mcu.IP7=SAI2
ProjectManager.CoupleFile=false
RCC.SYSCLKFreq_VALUE=216000000
Dma.SDMMC1_TX.1.MemBurst=DMA_MBURST_INC4
KeepUserPlacement=false
PA13.Locked=true
PJ5.Signal=LTDC_R6
PA15.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PC6.GPIOParameters=GPIO_Label
PF13.GPIOParameters=GPIO_Label
RCC.HSI_VALUE=16000000
PA8.GPIO_PuPd=GPIO_NOPULL
PI6.GPIOParameters=GPIO_Label
PH0/OSC_IN.GPIO_Label=OSC_25M [NZ2520SB-25.00M_OUT]
RCC.PLLQ=9
PI3.GPIO_Label=ARDUINO D7
PH3.Signal=FMC_SDNE0
RCC.PLLM=25
RCC.PLLN=432
PA2.Mode=RMII
PC8.Locked=true
CORTEX_M7.CPU_DCache=Enabled
SH.FMC_D8_DA8.ConfNb=1
PD9.Locked=true
PB8.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PJ2.GPIO_Label=LCD_R3 [RK043FN48H-CT672B_R3]
PB14.GPIO_Mode=GPIO_MODE_AF_PP
Dma.SDMMC1_TX.1.PeriphInc=DMA_PINC_DISABLE
PB12.Signal=USB_OTG_HS_ULPI_D5
PJ13.Signal=LTDC_B1
PG11.GPIOParameters=GPIO_Label
PE1.GPIOParameters=GPIO_Label
PK1.GPIO_Label=LCD_G6 [RK043FN48H-CT672B_G6]
PA3.GPIO_Label=ULPI_D0 [USB3320C-EZK_D0]
SAI2.IPParameters=Instance-SAI_A_MasterWithClock,VirtualMode-SAI_A_MasterWithClock,MClockEnable-SAI_A_MasterWithClock,RealAudioFreq-SAI_A_MasterWithClock,ErrorAudioFreq-SAI_A_MasterWithClock,Instance-SAI_B_SyncSlave,VirtualMode-SAI_B_SyncSlave
PK1.GPIOParameters=GPIO_Label
PA6.Locked=true
SH.FMC_D7_DA7.0=FMC_D7
PK5.Locked=true
RCC.USART1Freq_Value=108000000
PK5.Signal=LTDC_B6
PB15.GPIO_Mode=GPIO_MODE_AF_PP
SH.FMC_A4.ConfNb=1
PH12.Signal=DCMI_D3
PH12.Locked=true
Dma.SDMMC1_RX.0.MemInc=DMA_MINC_ENABLE
VP_FATFS_VS_SDIO.Mode=SDIO
PC12.Locked=true
PG4.Signal=FMC_A14_BA0
PG4.Locked=true
RCC.PLLCLKFreq_Value=216000000
PC12.Signal=SDMMC1_CK
PB14.GPIO_Label=ARDUINO MISO/D12
PA14.GPIO_Label=SWCLK
PG6.GPIO_Label=ARDUINO D2
PH6.GPIO_Label=ARDUINO PWM/D6
PG3.GPIOParameters=GPIO_Label
PD3.GPIOParameters=GPIO_Label
CORTEX_M7.PREFETCH_ENABLE=1
PK6.GPIO_Label=LCD_B7 [RK043FN48H-CT672B_B7]
PC6.GPIO_Label=ARDUINO TX/D1
PJ3.GPIOParameters=GPIO_Label
PA3.GPIOParameters=GPIO_Label
PB6.GPIO_Label=QSPI_NCS [N25Q128A13EF840E_S]
PI6.GPIO_Label=SAI2_SDA [WM8994ECS/R_DACDAT1]
PJ6.GPIO_Label=LCD_R7 [RK043FN48H-CT672B_R7]
PD4.Locked=true
PC5.Mode=RMII
